package nss.Generators;

import nss.Helpers.Values;

/***********************************************************************************************************************
 * 10000000101111111110111111111 * Author: Sergei Nadolskiy       **************************************************** *
 * 10100000101000000010100000001 * @mail:  s.nadolskiy@gmail.com  **************************************************** *
 * 10010000101000000000100000000 * skype:  s.nadolskiy            **************************************************** *
 * 10001000101111111110111111111 ************************************************************************************* *
 * 10000100100000000010000000001 ************************************************************************************* *
 * 10000010101000000010100000001 * Project Name: PSMini   ************************************************************ *
 * 10000000101111111110111111111 **************************************************************** зроблено в Україні * *
 **********************************************************************************************************************/
public class ImageDateCreated {

    /*******************************************************************************************************************
     * Генеруємо вірний рік зйомки зображення ************************************************************************ *
     * *************************************************************************************************************** *
     * @param imageYear рік зйомки  ********************************************************************************** *
     * @return коректний рік зйомки ********************************************************************************** *
     ******************************************************************************************************************/
    public static String getYear(Object imageYear) {
        // якщо рік зйомки = 0
        if (imageYear.equals("0"))
            return Values.NO_YEAR;                                                 // вертаємо "Інші"
        // якщо рік зйомки менший ніж мінімальний рік (1975)
        if ((int)imageYear < Values.IMAGE_MIN_YEAR_CREATED)
            return Values.NO_YEAR;                                                 // вертаємо "Інші"
        return String.valueOf(imageYear);                                          // вертаємо рік зйомки
    }

    /*******************************************************************************************************************
     * Генеруємо вірний місяць зйомки зображення ********************************************************************* *
     * *************************************************************************************************************** *
     * @param imageYear  рік зйомки            *********************************************************************** *
     * @param imageMonth місяць зйомки         *********************************************************************** *
     * @param monthFormatType  формат місяця   *********************************************************************** *
     *                   0 - повна назва       *********************************************************************** *
     *                   1 - коротка           *********************************************************************** *
     * @return місяць зйомки у потрібній формі *********************************************************************** *
     ******************************************************************************************************************/
    public static String getMonth(Object imageYear, Object imageMonth, int monthFormatType) {
        // якщо немає року зйомки
        if (getYear(imageYear).equals(Values.NO_YEAR))
            return Values.NO_MONTH;                                                 // вертаємо порожній місяць ("")
        // інакше (якщо рік є)
        else {
            // якщо місяць зйомки дорівнює 0
            if (imageMonth.equals("0"))
                return Values.NO_MONTH;                                             // вертаємо порожній місяць ("")
            // інакше (якщо місяць більший ніж 0)
            else {
                // якщо потрібен повний місяць
                if (monthFormatType == Values.FULL_MONTH)
                    return Values.fullMonth[(int)imageMonth];                       // вертаємо повний місяць
                // інакше (якщо потрібен скорочений місяць)
                else
                    return Values.month[(int)imageMonth];                           // вертаємо короткий місяць
            }
        }
    }

    /*******************************************************************************************************************
     * Генеруємо дату зйомки ***************************************************************************************** *
     * *************************************************************************************************************** *
     * @param imageYear    рік зйомки                  *************************************************************** *
     * @param imageMonth   місяць зйомки               *************************************************************** *
     * @param imageDay     день зйомки                 *************************************************************** *
     * @param imageHour    година зйомки               *************************************************************** *
     * @param imageMinutes хвилина зйомки              *************************************************************** *
     * @param imageSeconds секунда зйомки              *************************************************************** *
     * @param sortType     формат дати                 *************************************************************** *
     *                     1 - для сортування за датою *************************************************************** *
     *                     0 - інші                    *************************************************************** *
     * @return  дата зйомки                            *************************************************************** *
     ******************************************************************************************************************/
    public static String getFullDate(Object imageYear, Object imageMonth, Object imageDay,
                                     Object imageHour, Object imageMinutes, Object imageSeconds,
                                     int sortType) {
        String month = getMonth(imageYear, imageMonth, Values.SMALL_MONTH);     // отримуємо місяць зйомки
        // якщо місяць порожній
        if (month.equals(Values.NO_MONTH))
            return Values.NO_MONTH;                                             // вертаємо порожню дату
        // інакше (якщо місяць не порожній)
        else {
            String day;
            // якщо день зйомки менший ніж 10
            if ((int)imageDay < 10)
                day = "0" + imageDay;                                           // додаємо 0 перед днем
            // інакше (якщо день зйомки більший ніж 10)
            else
                day = String.valueOf(imageDay);
            // якщо час зйомки - нульовий
            if (
                    (int)imageHour == 0    &&
                    (int)imageMinutes == 0 &&
                    (int)imageSeconds == 0) {
                // якщо тип для дати
                if (sortType == Values.FOR_DATE)
                    return "(" + day + "-" + month + "-" + imageYear + ")";     // вертаємо дату у форматі(DD-MM-YYYY)
                // інакше (якщо будь який інший тип)
                else {
                    String sMonth;
                    // якщо місяць зйомки менший ніж 10
                    if ((int)imageMonth < 10)
                        sMonth = "0" + imageMonth;                              // додаємо 0 перед місяцем
                    // інакше (якщо місяць зйомки більший ніж 10)
                    else
                        sMonth = String.valueOf(imageMonth);
                    return "(" + imageYear + "-" + sMonth + "-" + day + ")";    // вертаємо дату у форматі (YYYY-MM-DD)
                }
            // інакше (якщо чам зйомки не нульовий)
            } else {
                String sHour;
                String sMinutes;
                String sSeconds;
                // якщо година зйомки менша 10
                if ((int) imageHour < 10)
                    sHour = "0" + imageHour;                                    // додаємо 0 перед годиною
                // інакше (якщо година зйомки більша ніж 10)
                else
                    sHour = String.valueOf(imageHour);
                // якщо хвилина зйомки менша ніж 10
                if ((int) imageMinutes < 10)
                    sMinutes = "0" + imageMinutes;                              // додаємо 0 перед хвилиною
                // інакше (якщо хвилина зйомки більша наж 10)
                else
                    sMinutes = String.valueOf(imageMinutes);
                // якщо секунда зйомки менша ніж 10
                if ((int) imageSeconds < 10)
                    sSeconds = "0" + imageSeconds;                              // додаємо 0 перед секундою
                // інакше (якщо секунда зйомки більша наж 10)
                else
                    sSeconds = String.valueOf(imageSeconds);
                // якщо тип для дати
                if (sortType == Values.FOR_DATE)
                     return "(" + day + "-" + month + "-" + imageYear + "--"    // вертаємо дату у форматі (DD-MM-YYYY)
                            + sHour + "-" + sMinutes + "-" + sSeconds + ")";    // та час (HH-MM-SS)
                // інакше (будь який інакший тип)
                else {
                    String sMonth;
                    // якщо місяць менший ніж 10
                    if ((int) imageMonth < 10)
                        sMonth = "0" + imageMonth;                              // додаємо 0 перед місяцем
                    // інакше (якщо місяць більший ніж 10)
                    else
                        sMonth = String.valueOf(imageMonth);
                    return "(" + imageYear + "-" + sMonth + "-" + day + "--"    // вертаємо дату у форматі (YYYY-MM-DD)
                            + sHour + "-" + sMinutes + "-" + sSeconds + ")";    // та час (HH-MM-SS)
                }
            }
        }
    }
}